ceph/6hdd/nfs.2.log
4k_randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
4k_randread: (g=1): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
64k_write: (g=2): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=16
64k_read: (g=3): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=2
fio-3.7
Starting 4 processes
4k_randwrite: Laying out IO file (1 file / 5120MiB)
4k_randread: Laying out IO file (1 file / 5120MiB)
64k_write: Laying out IO file (1 file / 5120MiB)
64k_read: Laying out IO file (1 file / 5120MiB)

4k_randwrite: (groupid=0, jobs=1): err= 0: pid=315465: Tue Aug 18 11:28:33 2020
  write: IOPS=1745, BW=6980KiB/s (7148kB/s)(205MiB/30003msec)
    slat (nsec): min=1405, max=184984, avg=10282.63, stdev=11613.91
    clat (usec): min=1847, max=139283, avg=4570.35, stdev=2204.46
     lat (usec): min=1855, max=139294, avg=4580.95, stdev=2204.24
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    4], 20.00th=[    4],
     | 30.00th=[    4], 40.00th=[    5], 50.00th=[    5], 60.00th=[    5],
     | 70.00th=[    5], 80.00th=[    6], 90.00th=[    6], 95.00th=[    7],
     | 99.00th=[    9], 99.50th=[   16], 99.90th=[   19], 99.95th=[   24],
     | 99.99th=[  138]
   bw (  KiB/s): min= 4722, max= 6865, per=82.33%, avg=5746.46, stdev=421.78, samples=59
   iops        : min= 1180, max= 1716, avg=1436.22, stdev=105.38, samples=59
  lat (msec)   : 2=0.01%, 4=34.34%, 10=64.84%, 20=0.75%, 50=0.05%
  lat (msec)   : 250=0.02%
  cpu          : usr=1.02%, sys=1.95%, ctx=41401, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,52357,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
4k_randread: (groupid=1, jobs=1): err= 0: pid=315754: Tue Aug 18 11:28:33 2020
   read: IOPS=807, BW=3232KiB/s (3309kB/s)(94.8MiB/30024msec)
    slat (nsec): min=1390, max=108814, avg=9215.44, stdev=6631.51
    clat (usec): min=967, max=1544.6k, avg=19787.79, stdev=58299.45
     lat (usec): min=975, max=1544.6k, avg=19797.33, stdev=58299.70
    clat percentiles (usec):
     |  1.00th=[   1483],  5.00th=[   2933], 10.00th=[   4080],
     | 20.00th=[   5866], 30.00th=[   7439], 40.00th=[   8979],
     | 50.00th=[  10290], 60.00th=[  12256], 70.00th=[  16057],
     | 80.00th=[  21365], 90.00th=[  32113], 95.00th=[  45351],
     | 99.00th=[ 168821], 99.50th=[ 354419], 99.90th=[ 893387],
     | 99.95th=[1300235], 99.99th=[1367344]
   bw (  KiB/s): min=   65, max= 3409, per=68.25%, avg=2205.24, stdev=1181.12, samples=59
   iops        : min=   16, max=  852, avg=550.90, stdev=295.30, samples=59
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=3.81%, 4=5.87%, 10=37.65%, 20=30.80%, 50=17.72%
  lat (msec)   : 100=2.44%, 250=0.99%, 500=0.37%, 750=0.19%, 1000=0.08%
  cpu          : usr=0.49%, sys=0.94%, ctx=21695, majf=0, minf=24
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.9%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=24258,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
64k_write: (groupid=2, jobs=1): err= 0: pid=316034: Tue Aug 18 11:28:33 2020
  write: IOPS=2966, BW=185MiB/s (194MB/s)(5120MiB/27616msec)
    slat (usec): min=3, max=211, avg=17.23, stdev=11.04
    clat (usec): min=2177, max=34629, avg=5373.54, stdev=2127.33
     lat (usec): min=2194, max=34647, avg=5391.05, stdev=2126.38
    clat percentiles (usec):
     |  1.00th=[ 2999],  5.00th=[ 3458], 10.00th=[ 3720], 20.00th=[ 4113],
     | 30.00th=[ 4424], 40.00th=[ 4686], 50.00th=[ 4948], 60.00th=[ 5276],
     | 70.00th=[ 5604], 80.00th=[ 6194], 90.00th=[ 7111], 95.00th=[ 8291],
     | 99.00th=[14877], 99.50th=[19792], 99.90th=[24249], 99.95th=[26870],
     | 99.99th=[33162]
   bw (  KiB/s): min=101879, max=178218, per=81.53%, avg=154781.56, stdev=18865.29, samples=55
   iops        : min= 1591, max= 2784, avg=2417.91, stdev=294.74, samples=55
  lat (msec)   : 4=16.82%, 10=80.74%, 20=2.02%, 50=0.42%
  cpu          : usr=2.26%, sys=4.41%, ctx=63056, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,81920,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
64k_read: (groupid=3, jobs=1): err= 0: pid=316593: Tue Aug 18 11:28:33 2020
   read: IOPS=2188, BW=137MiB/s (143MB/s)(4112MiB/30057msec)
    slat (usec): min=3, max=553, avg= 9.94, stdev= 8.38
    clat (usec): min=319, max=764791, avg=901.82, stdev=7515.43
     lat (usec): min=325, max=764795, avg=911.98, stdev=7515.41
    clat percentiles (usec):
     |  1.00th=[   424],  5.00th=[   457], 10.00th=[   482], 20.00th=[   510],
     | 30.00th=[   529], 40.00th=[   545], 50.00th=[   562], 60.00th=[   578],
     | 70.00th=[   603], 80.00th=[   627], 90.00th=[   701], 95.00th=[   848],
     | 99.00th=[  6128], 99.50th=[ 17433], 99.90th=[ 50070], 99.95th=[ 63701],
     | 99.99th=[295699]
   bw (  KiB/s): min= 6656, max=198016, per=100.00%, avg=140328.13, stdev=46018.22, samples=60
   iops        : min=  104, max= 3094, avg=2192.60, stdev=719.03, samples=60
  lat (usec)   : 500=16.18%, 750=75.98%, 1000=5.01%
  lat (msec)   : 2=1.42%, 4=0.27%, 10=0.35%, 20=0.38%, 50=0.32%
  lat (msec)   : 100=0.08%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=0.91%, sys=2.47%, ctx=64446, majf=0, minf=41
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=65794,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=2

Run status group 0 (all jobs):
  WRITE: bw=6980KiB/s (7148kB/s), 6980KiB/s-6980KiB/s (7148kB/s-7148kB/s), io=205MiB (214MB), run=30003-30003msec

Run status group 1 (all jobs):
   READ: bw=3232KiB/s (3309kB/s), 3232KiB/s-3232KiB/s (3309kB/s-3309kB/s), io=94.8MiB (99.4MB), run=30024-30024msec

Run status group 2 (all jobs):
  WRITE: bw=185MiB/s (194MB/s), 185MiB/s-185MiB/s (194MB/s-194MB/s), io=5120MiB (5369MB), run=27616-27616msec

Run status group 3 (all jobs):
   READ: bw=137MiB/s (143MB/s), 137MiB/s-137MiB/s (143MB/s-143MB/s), io=4112MiB (4312MB), run=30057-30057msec